app/Controllers/produksi.php

SELECT *
FROM `bahan_baku`
---
    public function create()
    {
        $allBahan = $this->bahanBakuModel->findAll();

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (1, 50, 704000, '2', '2025-06-09 12:48:08')
---
            if ($produkOriginal['jumlah'] > 0) {
                $idOriginal = $this->produkModel->findOrCreateByName($produkOriginal['nama']);
                $this->produkModel->increaseStock($idOriginal, $produkOriginal['jumlah']);
                $this->produksiModel->insert([
                    'id_produk'     => $idOriginal,
                    'jumlah_hasil'  => $produkOriginal['jumlah'],
                    'total_modal'   => $totalModalProduksi,
                    'id_cabang' => $postData['id_cabang'],
                    'tgl_produksi'  => date('Y-m-d H:i:s')
                ]);

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (2, 4, 0, '1', '2025-06-09 12:41:44')
---
                if ($varian['jumlah'] > 0) {
                    $idVarian = $this->produkModel->findOrCreateByName($varian['nama']);
                    $this->produkModel->increaseStock($idVarian, $varian['jumlah']);
                    $this->produksiModel->insert([
                        'id_produk'     => $idVarian,
                        'jumlah_hasil'  => $varian['jumlah'],
                        'total_modal'   => 0,
                        'id_cabang' => $postData['id_cabang'],
                        'tgl_produksi'  => date('Y-m-d H:i:s')
                    ]);