app/Models/bahanbakumodel.php

    public function getBahanPrices(): array
    {
        $allBahan = $this->findAll();
---
SELECT *
FROM `bahan_baku`