app/Models/cabangmodel.php

SELECT *
FROM `cabang`
WHERE `cabang`.`is_deleted` = 0
AND `cabang`.`id_cabang` != 1
---
    public function getCabang($id = false)
    {
        if ($id == false) {
            return $this->db->table('cabang')
                ->where('cabang.is_deleted', 0)
                ->where('cabang.id_cabang !=', 1)
                ->get()->getResultArray();

INSERT INTO `cabang` (`nama_cabang`, `Alamat`) VALUES ('cabang 1', 'Lawangaji')
---
    public function insertCabang($data)
    {
        return $this->db->table($this->table)->insert($data);