app/Models/karyawanmodel.php

SELECT `karyawan`.*, `cabang`.`nama_cabang`, `cabang`.`alamat` AS `alamat_cabang`
FROM `karyawan`
JOIN `cabang` ON `cabang`.`id_cabang` = `karyawan`.`id_cabang`
WHERE `karyawan`.`is_deleted` = 0
AND `karyawan`.`id_karyawan` != 1
---
    public function getkaryawan($id = false)
    {
        if ($id == false) {
            return $this->db->table('karyawan')
                ->select('karyawan.*, cabang.nama_cabang, cabang.alamat AS alamat_cabang')
                ->join('cabang', 'cabang.id_cabang = karyawan.id_cabang')
                ->where('karyawan.is_deleted', 0)
                ->where('karyawan.id_karyawan !=', 1)
                ->get()->getResultArray();

SELECT *
FROM `karyawan`
WHERE `id_user` = '2'
AND `is_deleted` = 0
 LIMIT 1
---
    public function getKaryawanByIdUser($id_user)
    {
        return $this->where('id_user', $id_user)
            ->where('is_deleted', 0)
            ->first();