app/Models/produksimodel.php

    public function getTodaysProduction()
    {
        $today = date('Y-m-d');
        return $this->db->table('log_produksi')
            ->select('log_produksi.*, produk.nama_produk, cabang.nama_cabang')
            ->join('produk', 'produk.id_produk = log_produksi.id_produk')
            ->join('cabang', 'cabang.id_cabang = log_produksi.id_cabang')
            ->where("DATE(log_produksi.tgl_produksi)", $today)
            ->orderBy('log_produksi.tgl_produksi', 'ASC')
            ->get()->getResultArray();
---
SELECT `log_produksi`.*, `produk`.`nama_produk`, `cabang`.`nama_cabang`
FROM `log_produksi`
JOIN `produk` ON `produk`.`id_produk` = `log_produksi`.`id_produk`
JOIN `cabang` ON `cabang`.`id_cabang` = `log_produksi`.`id_cabang`
WHERE DATE(log_produksi.tgl_produksi) = '2025-06-09'
ORDER BY `log_produksi`.`tgl_produksi` ASC