app/Models/produkmodel.php

SELECT *
FROM `produk`
WHERE `nama_produk` = 'Pancung Original'
 LIMIT 1
INSERT INTO `produk` (`nama_produk`, `harga`, `stok`) VALUES ('Pancung Coklat', 2500, 0)
---
    public function findOrCreateByName(string $namaProduk): int
    {
        $produk = $this->where('nama_produk', $namaProduk)->first();
        if ($produk) {
            return $produk['id_produk'];
        } else {
            return $this->insert(['nama_produk' => $namaProduk, 'harga' => 2500, 'stok' => 0]);

UPDATE `produk` SET `stok` = stok + 13
WHERE `id_produk` = 1
---
    public function increaseStock(int $idProduk, int $jumlah)
    {
        $this->where('id_produk', $idProduk)->set('stok', "stok + $jumlah", false)->update();