app/Models/usermodel.php

SELECT *
FROM `user`
WHERE `username` = '0838765478'
AND `is_deleted` = 0
 LIMIT 1
---
    public function getUserByUsername(string $username)
    {
        return $this->where('username', $username)
            ->where('is_deleted', 0)
            ->first();

SELECT `karyawan`.*, `user`.*
FROM `user`
JOIN `karyawan` ON `user`.`id_user` = `karyawan`.`id_user`
WHERE `user`.`id_user` != 1
---
    public function getuser($id = false)
    {
        if ($id == false) {
            return $this->db->table('user')
                ->select('karyawan.*, user.*')
                ->join('karyawan', 'user.id_user = karyawan.id_user')
                ->where('user.id_user !=', 1)
                ->get()->getResultArray();

UPDATE `user` SET `is_deleted` = 0
WHERE `id_user` = '2'
---
    public function updateuser($data, $id)
    {
        return $this->db->table($this->table)->update($data, ['id_user' => $id]);